In [120]:
import pandas as pd

In [121]:
companies = {
    'Value': [220, 160, 140, 117, 94],
    'Change': [17.5, 11.9, -8.5, -2.1, 3.5],
    'Sector': ['Ratail', 'Tech', 'Tech', 'Tech', 'Tech']
}

data = pd.DataFrame(companies, index=['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'])
data

           Value  Change  Sector
Amazon       220    17.5  Ratail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [122]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [123]:
data.columns

Index(['Value', 'Change', 'Sector'], dtype='object')

In [124]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [125]:
data.describe()

            Value     Change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [126]:
data.loc[data['Value'] > 150]

        Value  Change  Sector
Amazon    220    17.5  Ratail
Google    160    11.9    Tech

In [127]:
data['Change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsung       3.5
Name: Change, dtype: float64

In [128]:
data

           Value  Change  Sector
Amazon       220    17.5  Ratail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [129]:
data.iloc[3]

Value      117
Change    -2.1
Sector    Tech
Name: Microsoft, dtype: object

In [130]:
data.iloc[1:4, 1:3]

           Change Sector
Google       11.9   Tech
Apple        -8.5   Tech
Microsoft    -2.1   Tech

In [131]:
data[0:3]

        Value  Change  Sector
Amazon    220    17.5  Ratail
Google    160    11.9    Tech
Apple     140    -8.5    Tech

In [132]:
data['Amazon':'Microsoft']

           Value  Change  Sector
Amazon       220    17.5  Ratail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech

In [133]:
data['Value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsung      188
Name: Value, dtype: int64

In [134]:
data['Value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsung       92
Name: Value, dtype: int64

In [135]:
data['Value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: Value, dtype: int64

In [136]:
div, rem = divmod(data['Value'], 2)
# div and mod values in 'Value' col by 2
div, rem
# div is the floor of each value divided by 2
# rem is the remainder of each value divied by 2

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsung       47
 Name: Value, dtype: int64,
 Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsung      0
 Name: Value, dtype: int64)

In [137]:
data.mean()

Value     146.20
Change      4.46
dtype: float64

In [138]:
data.sum(0)

Value                        731
Change                      22.3
Sector    RatailTechTechTechTech
dtype: object

In [139]:
data.sum(1)

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsung       97.5
dtype: float64

In [140]:
data.std()

Value     48.095738
Change    10.456003
dtype: float64

In [141]:
data.quantile(.5)

Value     140.0
Change      3.5
Name: 0.5, dtype: float64

In [142]:
data.min()

Value         94
Change      -8.5
Sector    Ratail
dtype: object

In [143]:
data.cumsum() # return cumulative sum over a DataFrame or Series axis

           Value  Change                  Sector
Amazon       220    17.5                  Ratail
Google       380    29.4              RatailTech
Apple        520    20.9          RatailTechTech
Microsoft    637    18.8      RatailTechTechTech
Samsung      731    22.3  RatailTechTechTechTech

In [144]:
data.count()

Value     5
Change    5
Sector    5
dtype: int64